package com.example.doc.utils;

public class ConclusionUtils {
    final static String[] anxietyConclusion = {
            "您的焦虑水平在正常范围之内，正常范围内的焦虑水平，不意味着您此刻没有焦虑情绪，可能您正感到轻微的不适、不安，我们将此称为适度焦虑。" +
                    "适度焦虑是一种“合理情绪”，也就是我们平常会感受到的一些情绪，比如考试前的紧张，上台演讲之前的焦虑，" +
                    "重大抉择之前的恐慌，适度焦虑有助于我们认清自身状态，抱持警惕和刺激，化焦虑为动力，激发人的行动力。如果您为此感到困扰，" +
                    "让我们以“不评判”为目的去观察自己的情绪、想法，不与它较劲，观察它，品味它，体会它，从而去接纳它，也许你会发现，接纳焦虑情绪，" +
                    "比逃避焦虑，会让你感到更轻松，更舒适。如果你感到轻松，继续保持愉快心情吧！",
            "您的焦虑水平为轻度，也许焦虑情绪已经让你感到困扰，甚至有时感到肌肉紧张，呼吸不畅，过度思索感到无法停止思考，让你的生活受到了一定的影响，" +
                    "缓解焦虑小建议： 1.接纳自己的情绪，当你对抗、或者回避焦虑的时候，也许你会发现自己感到更加的不自在。我们不需要“克服”焦虑，" +
                    "我们需要的是学会与焦虑共存。可尝试了解“森田疗法”，也许会让您有收获； 2.去跑步吧！坚持每天做有氧运动可以起到避免焦虑的作用，" +
                    "运动也可以给我们提供时间寻求有效的解决问题的方法，还可以缓解紧张情绪；" +
                    " 3.体验深度放松：冥想、瑜伽、正念等方式是经过验证过的有助于人们深度放松的方法，这种深度放松的方式可以让人养成遇事平和冷静的习惯；" +
                    " 4.如果做了诸多尝试与调整，依然存在困扰，建议寻找平台的专业心理咨询师寻求心理帮助。祝好。" +
                    "【温馨提示：在本量表中得分并不能作为焦虑症的诊断标准，仅供你了解自己使用。焦虑症的诊断和治疗，只有精神科医生才能进行哦】",
            "您的焦虑水平为中度，引起你焦虑的原因，可能不只是当下生活中的实际困扰，还包括对未来无名的担心，甚至是模糊的、不明原因的焦虑和担心，" +
                    "而且焦虑情绪似乎已经不只是影响到了你的心态、正常生活，你的身体也感受到了焦虑，身体过分紧张，肌肉过于紧绷，呼吸不够轻松，" +
                    "过分机警等等，在此情况下，可尝试运动、呼吸法、肌肉渐进放松法、正念、冥想、瑜伽等方式缓解情绪，" +
                    "如果感到靠自己的调整依然无法摆脱焦虑情绪，建议寻找本平台专业的心理咨询师寻求专业帮助，同时，建议到精神科或心理科做进一步检查，" +
                    "明确的焦虑症诊断需要到精神科进行，对于较严重的焦虑症，尽早进行药物治疗才是关键。多多关爱自己的心，祝好。" +
                    "【温馨提示：在本量表中得分并不能作为焦虑症的诊断标准，仅供你了解自己使用。焦虑症的诊断和治疗，只有精神科医生才能进行哦】",
            "您的焦虑水平较高，可尝试运动、呼吸法、肌肉渐进放松法、正念、冥想、瑜伽等方式缓解情绪，如果感到靠自己的调整依然无法摆脱焦虑情绪，" +
                    "建议寻找本平台专业的心理咨询师寻求专业帮助，同时，建议到精神科或心理科做进一步检查，明确的焦虑症诊断需要到精神科进行，" +
                    "对于较严重的焦虑症，尽早进行药物治疗才是关键。焦虑症的主要症状是，内心充满了过度的、长久的、模糊的、不明原因的焦虑和担心。" +
                    "其具体症状包括以下四类：身体紧张、自主神经系统反应性过强、对未来无名的担心、过分机警。这些症状有时单独存在，也可同时出现。" +
                    "多多关爱自己的心，祝好。【温馨提示：在本量表中得分并不能作为焦虑症的诊断标准，仅供你了解自己使用。焦虑症的诊断和治疗，" +
                    "只有精神科医生才能进行哦】"
    };
    final static String[] aloneConclusion = {
            "【我的结果:低度孤独】 想要你感觉到孤独，应该是一件很难的事情。你从小就是被爱围着长大的，安全感十足的你广交朋友，" +
                    "而且每一个朋友对你来说都是付出真心的交往，所以朋友对你也是一样关怀体贴。所以你要感到孤独的话，事情一定很严重了。",
            "【我的结果:一般偏下孤独】 你是基本不会感觉到孤独感的，你活泼开朗，人际关系良好，而且拥有一帮可以交心的知己，" +
                    "有事没事你的朋友都会陪伴在你身边，所以你的情绪长期处于快乐满足的状态。",
            "【我的结果:你处于中间水平】 你的性格比较稳定，有一群可以交心的好朋友，而且你懂得释放压力，懂得交心，所以你很少感觉到孤独。",
            "【我的结果 :一般偏上孤独】 你有几个不错的朋友，但你缺乏安全感，不愿意把心事与人倾诉，或许你外面大咧咧的，" +
                    "但实际上你的内心充满了寂寞，夜深人静的时候会感到孤独。",
            "【我的结果 :高度孤独】 你是一个没有安全感，超级孤独的人。你不相信别人，宁愿活在自己的世界也不愿意与人交流，" +
                    "导致你的内心十分空虚寂寞，缺乏关心与爱。"
    };
    final static String[] delayConclusion = {
            "你有【轻微的拖延倾向】，你所完成的工作常常都不是很完美，因为你没有给自己充足的时间去好好雕琢细节。" +
                    "你会有轻微的拖延倾向，但这并没有影响你的整体工作效率。好好思考自己在哪个环节上易产生拖延，然后在这方面努力做出一些改变吧！",
            "你有【中度拖延倾向】，我知道你不喜欢自己拖延，但你离重度拖延不远啦！你总是心急火燎地赶工，在最后一刻完成任务。" +
                    "当回头看自己的一天甚至过去的一周时，你都会很惊奇感慨：“这些时间都去哪儿了？我都干了些什么？”" +
                    "你可以通过对任务进行优先级管理来帮助自己摆脱拖延，并思考思考到底什么才是你生命最重要的。",
            "你有【重度拖延倾向】，你习惯于把重要的工作和一些毫不相关的小事混在一起。你经常拖延工作甚至根本就无视工作。" +
                    "你把大把时间浪费在了制定计划和目标、做白日梦上面。或许你需要一个时间管理教练，或自己开始学习时间管理。" +
                    "时间管理能教你设定可达成的目标，并且找到终结拖延习惯的积极途径，你一定会从中受益！"
    };
    final static String[] depressionConclusion = {
            "经过检测您【无抑郁】，这是一个非常好的健康指标，意味着您目前的情绪状态稳定，能够正常地处理日常生活中的压力和挑战。" +
                    "在心理和情感层面，您能够保持积极和乐观的态度，这是维持整体健康和生活质量的重要因素。（以上测试结果仅供参考）",
            "经过检测您为【轻微至轻度抑郁】，这意味着您可能会经历一些常见的抑郁症状，如持续的低落情绪、兴趣减退、疲劳感增加等，但这些症状尚未达到中度或重度抑郁的程度。" +
                    "建议您关注自己的情绪变化，并考虑采取适当的措施来改善心理状态，如进行心理咨询、增加社交活动、保持良好的作息习惯等。" +
                    "同时，如果您觉得症状有所加重或持续影响日常生活，请及时寻求专业医生的帮助。（以上测试结果仅供参考）",
            "经过检测您为【中至重度抑郁】,经过深入细致的心理健康评估，结果显示您目前的状况已达到中至重度抑郁的标准。这意味着您可能会经历更为显著和持续的抑郁症状，" +
                    "如深度的情绪低落、严重的兴趣或愉悦感丧失、极度的疲劳和能量下降、认知功能受损、自我价值感降低、甚至可能出现自杀念头等。" +
                    "这些症状已在很大程度上影响到您的日常生活和工作能力。面对这样的诊断结果，强烈建议您积极寻求专业精神健康治疗机构的帮助。（以上测试结果仅供参考）",
            "经过检测您为【重度抑郁】，重度抑郁症是一种严重的心境障碍，它可能让您经历持续的、极为严重的情绪低落和绝望感，" +
                    "这种情绪几乎影响到您日常生活的各个方面。您可能会丧失对以往活动的兴趣或乐趣，感到极度疲劳和缺乏动力，睡眠模式受到严重影响，" +
                    "认知功能如注意力和决策能力明显下降，并可能出现频繁的自责、无价值感或无助感。由于重度抑郁症会对您的工作、学习和社交活动产生重大影响，" +
                    "建议您与医疗提供者密切合作，制定出一套个性化的综合治疗方案。同时，家人和朋友的支持也非常重要，" +
                    "他们的理解和协助会极大地帮助您走出抑郁的阴霾。（以上测试结果仅供参考）"
    };
    final static String[] matureConclusion = {
            "【很不成熟】 你处理社会生活问题仍不成熟。" +
                    "你喜欢单凭个人粗浅的直觉印象和一时的感情行事，好冲动、莽撞、不识大体。" +
                    "或者相反，即遇事退缩不前，害怕出头露面，孤独而自卑。你容易得罪人，也容易被人欺骗。" +
                    "这与现代社会生活的要求很不适应，你需要设法使自己尽快地成熟起来才能保护自己。",
            "【不大成熟】 你还不善于处理社会生活中的各种问题和矛盾，不善于观察影响问题的各种复杂因素，不能准确地预见自己行为的结果，" +
                    "还不能很好地适应复杂的社会生活。",
            "【一般】 你的个性成熟程度属于中等水平。你的个性具有两重性：一半老练，另一半是幼稚的。还需要在社会生活实践中慢慢磨炼。",
            "【比较成熟】你是较为成熟的人。在大部分事情的处理上你是很得体的。你能够很好地适应社会，建立起较良好的人际关系。",
            "【很成熟】 你是个很成熟老练的人。大凡个性成熟的人，在社会中都游刃有余，处理泰然。" +
                    "他们知道怎样妥善地处理个人所遇到的各种社会问题。他们能够准确地判断：处理一个问题，哪些方式是有效的，哪些方式则会造成不良的后果，" +
                    "从而选择一种最佳期的处理办法。他们常常成为别人请教和效仿的对象。"
    };
    final static String[] socialConclusion = {
            "您在人际关系社交上表现正常，无这方面的问题。 建议：请继续保持。",
            "您在社交上有一定的回避和苦恼，可能来源于你对自我表现的一种否定性评价，或者过分关注他人对你言行的评价和看法，这些想法和观念让您更倾向于一个人待着而不是去融入集体性的社交活动。 " +
                    "建议：您可以尝试换位思考，从自己看待别人的角度来看待自己，这才是真正的别人的眼光，而不是拘泥在自我的遐想里。" +
                    "可以尝试调整对待自己的目标，根据自己的实际情况出发，设定一个个能够实现的短期目标。",
            "您在社交上有较为严重的回避和苦恼，您曾经应该也尝试过很多次去融入集体中，可能都没能获得满意的效果，对于这些失败的经验印象过于深刻，" +
                    "所以您现在可能根本没有意愿与他人去做交流。 建议：您可以试着去找寻符合自己兴趣的场合和话题，不必勉强自己去融入任何的团体。" +
                    "您也可以尝试进行心理咨询，在咨询的安全氛围中慢慢去恢复对人际交往的信心。"
    };
    public static String getConclusion(String type, int score)
    {
        String conclusion = null;
        if (type.equals("0"))
        {
            if (score < 50) conclusion = anxietyConclusion[0];
            else if (score < 60) conclusion = anxietyConclusion[1];
            else if (score < 70) conclusion = anxietyConclusion[2];
            else conclusion = anxietyConclusion[3];
        }else if (type.equals("1"))
        {
            if (score < 28) conclusion = aloneConclusion[0];
            else if (score < 34) conclusion = aloneConclusion[1];
            else if (score < 40) conclusion = aloneConclusion[2];
            else if (score < 45) conclusion = aloneConclusion[3];
            else conclusion = aloneConclusion[4];
        }else if (type.equals("2"))
        {
            if (score < 5) conclusion = delayConclusion[0];
            else if (score < 12) conclusion = delayConclusion[1];
            else conclusion = delayConclusion[2];
        }else if (type.equals("3"))
        {
            if (score <= 40) conclusion = depressionConclusion[0];
            else if (score < 48) conclusion = depressionConclusion[1];
            else if (score < 56) conclusion = depressionConclusion[2];
            else conclusion = depressionConclusion[3];
        }else if (type.equals("4"))
        {
            if (score < 0) conclusion = matureConclusion[0];
            else if (score < 50) conclusion = matureConclusion[1];
            else if (score < 100) conclusion = matureConclusion[2];
            else if (score < 150) conclusion = matureConclusion[3];
            else conclusion = matureConclusion[4];
        }else if (type.equals("5"))
        {
            if (score < 13) conclusion = socialConclusion[0];
            else if (score < 21) conclusion = socialConclusion[1];
            else conclusion = socialConclusion[2];
        }else
        {
            conclusion = "type错误";
        }
        return conclusion;
    }
}
